testcase/inter/0/nut
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    xmin
    {
        type            calculated;
        value           uniform 0;
    }
    
    xmax
    {
        type            calculated;
        value           uniform 0;
    }
    
    ymin
    {
        type            calculated;
        value           uniform 0;
    }
    
    ymax
    {
        type            calculated;
        value           uniform 0;
    }
    
    zmin
    {
        type            calculated;
        value           uniform 0;
    }
    
    zmax
    {
        type            calculated;
        value           uniform 0;
    }

    
    mywalls
    {
        type            nutkRoughWallFunction;
        Ks              uniform 0.01;  // roughness height = sand-grain roughness (0 for smooth walls), in m
        Cs              uniform 0.5;    // roughness constant, default 0.5
        value           uniform 0.0;
    }
    
    bottom
    {
        type            nutkRoughWallFunction;
        Ks              uniform 0.05;  // roughness height = sand-grain roughness (0 for smooth walls), in m
        Cs              uniform 0.5;    // roughness constant, default 0.5
        value           uniform 0.0;
    }
      
    column
    {
        type            nutkRoughWallFunction;
        Ks              uniform 0.01;  // roughness height = sand-grain roughness (0 for smooth walls), in m
        Cs              uniform 0.5;    // roughness constant, default 0.5
        value           uniform 0.0;
    }
      

}

// ************************************************************************* //
