testcase/inter/constant/fvOptions
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


// Optional: Limit velocities to stabilize the model
limitU
    {
        type            limitVelocity; // Adds an explicit momentum source to limit high velocities
        active          no;            // Set to yes, if you really want it!
        selectionMode   all;
        max             25.0;          // Set this to a value higher than anything you would physically expect!
    }



