testcase/inter/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "3/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    xmin
    {
        type            wall;
        inGroups        1(wall);
        nFaces          402;
        startFace       920645;
    }
    xmax
    {
        type            wall;
        inGroups        1(wall);
        nFaces          393;
        startFace       921047;
    }
    zmax
    {
        type            wall;
        inGroups        1(wall);
        nFaces          4756;
        startFace       921440;
    }
    mywalls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          19050;
        startFace       926196;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          11773;
        startFace       945246;
    }
    column
    {
        type            wall;
        inGroups        1(wall);
        nFaces          4272;
        startFace       957019;
    }
)

// ************************************************************************* //
